import React, { useEffect } from "react";
import './Policy.scss'
import { Helmet } from "react-helmet-async";
import useTracking from "../../utils/useTracking";

const DeliveryAndPrivacy = () => {
    useTracking();
    useEffect(() => {
        window.scrollTo({
            top: 0,
            behavior: 'smooth'
        });
    }, []);


    return (
        <>
            <Helmet>
                <title>سياسة التوصيل والاسترجاع - همسات للأدوات المنزلية</title>
                <meta name="description" content="تعرف على سياسة التوصيل، مدة التوصيل، رسوم الشحن، وسياسة الاستبدال والاسترجاع في موقع همسات للأدوات المنزلية." />
                <meta name="keywords" content="توصيل, استبدال, استرجاع, سياسة الموقع, همسات, أدوات منزلية, مصر" />
                <link rel="canonical" href={`${process.env.REACT_APP_API_URL}/deliverypolicy`} />
            </Helmet>
            <div className="terms-conditions">
                <div className="term">
                    <h1 className="mb-4"> سياسة التوصيل</h1>

                    <p>
                        نلتزم في موقعنا بتوصيل جميع الطلبات إلى عملائنا داخل جمهورية مصر العربية،
                        ونوفر خدمة التوصيل إلى جميع المحافظات.
                    </p>

                    <h2>مدة التوصيل</h2>
                    <ul>
                        <li>يتم توصيل الطلبات خلال فترة تتراوح من 2 إلى 5 أيام عمل داخل محافظة الشرقية.</li>
                        <li>قد تستغرق فترة التوصيل من 3 إلى 10 أيام عمل لباقي المحافظات.</li>
                        <li>في بعض الحالات الاستثنائية (مثل الظروف الجوية أو الضغط على شركات الشحن) قد يحدث تأخير بسيط وسيتم إخطار العميل فوراً.</li>
                    </ul>

                    <h2>رسوم التوصيل</h2>
                    <p>
                        تختلف رسوم التوصيل حسب المحافظةوحجم الطلب او عدد السلع المطلوبة ويتم إختار العميل بتكلفة الشحن أثناء مكالمة تأكيد الطلب. قد يتم
                        إعفاء العميل من رسوم التوصيل في حال وجود عروض (يتم إختارة هاتفياً).
                    </p>

                    <h2>تتبع الطلب</h2>
                    <p>
                        بعد تأكيد الشراء، يتم التواصل مع العميل وتزويده برقم متابعة الشحنة علي الموقع او خلال شركة الشحن
                    </p>

                    <h2>الاستلام والفحص</h2>
                    <p>
                        على العميل التحقق من سلامة المنتجات عند الاستلام. في حال وجود تلف أو منتج
                        غير مطابق، يجب التواصل مع خدمة العملاء <strong>خلال ٢٤ ساعة</strong> من الاستلام.
                        (في حالة عدم التواصل خلال ٢٤ ساعة لا يحق للعميل استبدال او إرجاع المنتج لا في حالة عيوب الصناعة)
                    </p>
                </div>
                <div className="term">
                    <h1 className="my-4">سياسة الاستبدال والاسترجاع</h1>

                    <h2>مدة الاستبدال/الاسترجاع</h2>
                    <p>يحق للعميل استبدال أو استرجاع المنتج خلال ١٤ يوم من تاريخ الاستلام.(طبقاً لقانون حماية المستهلك المصري)</p>

                    <h2>شروط الاسترجاع والاستبدال</h2>
                    <ul>
                        <li>أن يكون المنتج بحالته الأصلية كما استُلم (لم يُستخدم أو يُغسل أو يُفتح التغليف الأصلي).</li>
                        <li>إرفاق الفاتورة أو إيصال الشراء.</li>
                        <li>المنتجات المخفضة أو العروض الخاصة قد لا تشملها سياسة الاسترجاع إلا في حالة وجود عيب مصنعي.</li>
                        <li>المنتجات الغذائية أو الصحية أو التي لها طبيعة خاصة لا تُستبدل ولا تُسترجع حفاظاً على السلامة العامة.</li>
                    </ul>

                    <h2>في حالة وجود عيب أو خطأ</h2>
                    <p>
                        إذا كان المنتج تالفاً أو غير مطابق للطلب، نتحمل كامل مسؤولية التوصيل والإرجاع
                        دون أي رسوم إضافية على العميل.
                    </p>

                    <h2>رسوم الشحن</h2>
                    <p>
                        في حالة الاسترجاع بسبب رغبة العميل فقط (وليس بسبب خطأ من الموقع)، يتحمل العميل تكلفة الشحن.
                    </p>

                    <h2>آلية الاسترجاع</h2>
                    <p>
                        بعد التواصل مع خدمة العملاء، يتم إرسال مندوب الشحن لاستلام المنتج ويتم استرداد مبلغ السلعة بعد معاينة السلعة من قبل البائع
                        <br />
                        يتم إرجاع مبلغ السلعة للعميل <strong>(إما تحويل بنكي أو رصيد محفظة إلكترونية)</strong>
                        <br />
                        . قد يستغرق رد المبلغ من ٧ إلى ١٤ يوم عمل حسب إجراءات البنوك أو شركات الدفع.
                    </p>
                </div>

            </div>
        </>
    );
};

export default DeliveryAndPrivacy;
